---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceSingleCurveLoopsAsSplitters
source: html/18e4b294-33fe-6fde-106b-bc9953b5f951.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceSingleCurveLoopsAsSplitters Property

Curve elements forming a single curve loop cannot be used as splitters and are ignored.

## Syntax (C#)
```csharp
public static FailureDefinitionId DividedSurfaceSingleCurveLoopsAsSplitters { get; }
```